#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_admin_master.data.keycloak_role.target_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_admin_master.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_admin_master.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_admin_master.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = "master"
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_admin_master.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "apigw Realm Administrator"
      + path     = (known after apply)
      + realm_id = "master"
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_admin_master.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = "master"
      + role_ids   = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_admin_master.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "apigw-realm-admin-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "apigw-realm-admin-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = "master"
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_admin_master.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = "master"
      + role                    = "apigw-realm-admin"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_admin_master.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "apigw-realm-admin"
      + realm_id        = "master"
    }

  # module.keycloak_dev.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "realm-management"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.data.keycloak_role.target_roles["realm-admin"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Administrator"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-admin-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-admin-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_dev.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-admin"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "realm-management"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Viewer"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-viewer-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-viewer-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_dev.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-viewer"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_dev.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-viewer"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "realm-management"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.data.keycloak_role.target_roles["realm-admin"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Administrator"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-admin-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-admin-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_prod.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-admin"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "realm-management"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Viewer"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-viewer-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-viewer-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_prod.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-viewer"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_prod.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-viewer"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "realm-management"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.data.keycloak_role.target_roles["realm-admin"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Administrator"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-admin-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-admin-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-admin"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_admin.module.realm_admin.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-admin"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.data.keycloak_openid_client.realm_management will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_openid_client" "realm_management"  {
      + access_token_lifespan                      = (known after apply)
      + access_type                                = (known after apply)
      + admin_url                                  = (known after apply)
      + authentication_flow_binding_overrides      = (known after apply)
      + authorization                              = (known after apply)
      + backchannel_logout_revoke_offline_sessions = (known after apply)
      + backchannel_logout_session_required        = (known after apply)
      + backchannel_logout_url                     = (known after apply)
      + base_url                                   = (known after apply)
      + client_authenticator_type                  = (known after apply)
      + client_id                                  = "realm-management"
      + client_offline_session_idle_timeout        = (known after apply)
      + client_offline_session_max_lifespan        = (known after apply)
      + client_secret                              = (sensitive value)
      + client_session_idle_timeout                = (known after apply)
      + client_session_max_lifespan                = (known after apply)
      + consent_required                           = (known after apply)
      + description                                = (known after apply)
      + direct_access_grants_enabled               = (known after apply)
      + enabled                                    = (known after apply)
      + exclude_session_state_from_auth_response   = (known after apply)
      + extra_config                               = (known after apply)
      + frontchannel_logout_enabled                = (known after apply)
      + frontchannel_logout_url                    = (known after apply)
      + full_scope_allowed                         = (known after apply)
      + id                                         = (known after apply)
      + implicit_flow_enabled                      = (known after apply)
      + login_theme                                = (known after apply)
      + name                                       = (known after apply)
      + pkce_code_challenge_method                 = (known after apply)
      + realm_id                                   = (known after apply)
      + resource_server_id                         = (known after apply)
      + root_url                                   = (known after apply)
      + service_account_user_id                    = (known after apply)
      + service_accounts_enabled                   = (known after apply)
      + standard_flow_enabled                      = (known after apply)
      + use_refresh_tokens                         = (known after apply)
      + use_refresh_tokens_client_credentials      = (known after apply)
      + valid_redirect_uris                        = (known after apply)
      + web_origins                                = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-authorization"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-authorization"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-clients"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-clients"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-events"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-events"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-identity-providers"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-identity-providers"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-realm"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-realm"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.data.keycloak_role.target_roles["view-users"] will be read during apply
  # (config refers to values not yet known)
 <= data "keycloak_role" "target_roles"  {
      + attributes      = (known after apply)
      + client_id       = (known after apply)
      + composite_roles = (known after apply)
      + description     = (known after apply)
      + id              = (known after apply)
      + name            = "view-users"
      + realm_id        = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.keycloak_group.group will be created
  + resource "keycloak_group" "group" {
      + id       = (known after apply)
      + name     = "Realm Viewer"
      + path     = (known after apply)
      + realm_id = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.keycloak_group_roles.role_group_binding will be created
  + resource "keycloak_group_roles" "role_group_binding" {
      + exhaustive = true
      + group_id   = (known after apply)
      + id         = (known after apply)
      + realm_id   = (known after apply)
      + role_ids   = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.keycloak_openid_client.service_account will be created
  + resource "keycloak_openid_client" "service_account" {
      + access_type                               = "CONFIDENTIAL"
      + backchannel_logout_session_required       = true
      + client_authenticator_type                 = "client-secret"
      + client_id                                 = "realm-viewer-cli"
      + client_secret                             = (sensitive value)
      + consent_required                          = false
      + direct_access_grants_enabled              = false
      + display_on_consent_screen                 = false
      + enabled                                   = true
      + exclude_session_state_from_auth_response  = false
      + frontchannel_logout_enabled               = false
      + full_scope_allowed                        = true
      + id                                        = (known after apply)
      + implicit_flow_enabled                     = false
      + name                                      = "realm-viewer-cli"
      + oauth2_device_authorization_grant_enabled = false
      + realm_id                                  = (known after apply)
      + resource_server_id                        = (known after apply)
      + service_account_user_id                   = (known after apply)
      + service_accounts_enabled                  = true
      + standard_flow_enabled                     = false
      + use_refresh_tokens                        = true
      + use_refresh_tokens_client_credentials     = false
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.keycloak_openid_client_service_account_realm_role.role_service_account_binding will be created
  + resource "keycloak_openid_client_service_account_realm_role" "role_service_account_binding" {
      + id                      = (known after apply)
      + realm_id                = (known after apply)
      + role                    = "realm-viewer"
      + service_account_user_id = (known after apply)
    }

  # module.keycloak_test.module.custom_realms.module.apigw.module.realm_viewer.module.realm_viewer.keycloak_role.role will be created
  + resource "keycloak_role" "role" {
      + composite_roles = (known after apply)
      + id              = (known after apply)
      + name            = "realm-viewer"
      + realm_id        = (known after apply)
    }

Plan: 48 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...```

</details>

*Pusher: @arcshiftsolutions, Action: `pull_request`*